export const ahadith: {content: string}[] = [
  {
    content:
      "أخرج الترمذي وحسنه عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم : يقول الرب عز وجل:(من شغله القرآن وذكري عن مسألتي؛ أعطيته أفضل ما أعطي السائلين. وفضل كلام الله على سائر الكلام كفضل الله على خلقه ) .",
  },
  {
    content:
      "أخرج مسلم عن أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:(لحامل القرآن دعوة مستجابة).",
  },
  {
    content:
      "أخرج الترمذي عن أبن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:( من قرأ حرفاً من كتاب الله فله به حسنة ، والحسنة يعشر أمثالها ، لا أقول : ألم حرف ، ولكن ألف حرف ، ولام حرف ، وميم حرف ) . قال الترمذي :حسن صحيح غريب .",
  },
  {
    content:
      "أخرج البخاري و مسلم عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم :  ( مثل المؤمن الذي يقرأ القرآن مثل الأترجة ريحها طيب وطعمها طيب ،ومثل الذي لا يقرأ القرآن كمثل التمرة لا ريح لها وطعمها حلو ، ومثل المنافق الذي يقرأ القرآن مثل الريحانة ريحها طيب وطعمها مر، ومثل الذي لا يقرأ القرآن كمثل الحنظلة ليس لها ريح و طعمها مر ) .",
  },
  {
    content:
      "أخرج البخاري ومسلم وأبو داود والترمذي والنسائي وابن ماجة عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم :( الماهر بالقرآن مع السفرة الكرام البررة ، والذي يقرأ القرآن ويتتعتع فيه وهو عليه شاق له أجران ) ، وفي رواية :( والذي يقرؤه وهو يشتد عليه له أجران ) .",
  },
  {
    content:
      "أخرج الترمذي _وحسنه_وابن خزيمة في صحيحه ، والحاكم _وقال صحيح الإسناد_عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم :( يجيء صاحب القرآن يوم القيامة ، فيقول القرآن: يا ربّ حَلَّه ، فيلبس تاج الكرامة ، ثم يقول: يا رب زده ، فيلبس حلة الكرامة ، ثم يا رب ارض عنه ، فيقال له: اقرأ وارق ، ويزداد بكل آية حسنة ) .",
  },
  {
    content:
      "أخرج الترمذي _وصححه_وأبو داود وابن ماجة وابن حيان في صحيحه ، والحاكم_وقال صحيح الإسناد_عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم :  ( يقال لصاحب القرآن اقرأ وارق ، ورتل كما كنت ترتل في الدنيا ، فإن منزلك عند أخر آية تقرؤها ) .",
  },
  {
    content:
      "أخرج النسائي وابن ماجه والحاكم بإسناد صحيح ، عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم :( إن لله أهلين من الناس ) ، قالوا : من هم يا رسول الله ؟ قال:( أهل القرآن هم أهل الله وخاصته ) .",
  },
  {
    content:
      "اخرج الترمذي وابن ماجه بإسنادهما عن أبي طالب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم :( من قرأ القرآن فاستظهره فأحل حلاله وحرم حرامه أدخله الله به الجنة وشفعه في عشرة من أهل بيته كلهم وجبت لهم النار ).",
  },
  {
    content:
      "أخرج ابن ماجة بإسناد حسن عن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم :  ( لأن تغدوا فتعلم آية من كتاب الله خير من أن تصلي مائة ركعة ، ولأن تغدوا فتعلم باباً من العلم عُمل به أو لم يعمل به خير لك من أن تصلي ألف ركعة ) .",
  },
];
